Revit 2027 API
UnitFormatUtils.TryParse Method
Overload List
Name | Description
TryParse(Units, ForgeTypeId, String, Double) |  Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double) |  Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, Double, String) |  Parses a formatted string into a number with units if possible.
TryParse(Units, ForgeTypeId, String, ValueParsingOptions, Double, String) |  Parses a formatted string into a number with units if possible.
Top
See Also
Reference
UnitFormatUtils Class
Autodesk.Revit.DB Namespace